// ch_02 - 已转换为 DSL 字符串格式

export default [
  {
    page: 6,
    type: "普通",
    content: [
      "h2:第二章 本考试性质介绍、分析及学习要点信息系统项目管理师属于软考的高级科目。",
      "2012年5月，上午选择阅读量较大，计算较多，很多考生在此失败。",
      "2012年11月，上午难度一般，下午论文一个不正常，一个看似坑爹，总体不影响通过率2013年5月，上午极其简单，论文也不难，但是改卷论文卡人。",
      "2013年11月，上午很简单了，案例分析其实不难，论文更加让人别想着押题了，更加突出子题目的重要性了。但是这次案例分析卡了很多人，其实终其原因，还是大家“知其然，不知其所以然”，这点小马老师在讲课里多次提到，一定要注意理解名词，注意公式的变换推导。",
      "2014年5月，上午很简单了，案例分析其实不难（但是计算题有新颖之处），论文比较简单，只是改了论文答题纸字数。希望大家在学习的过程中，能够举一反三，千万莫死记硬背。",
      "2014年11月，上午稍微有点难度，案例可以说不难，论文写作也很简单。2014年11月过的人数算是很多了。",
      "2015年5月，上午简单，案例简单，在论文这块进行了卡人，但是通过人数还是非常多。",
      "2015年11月，三科比较还算比较均衡，40%的人挂在了案例上，35%的上挂在了论文上，25%的人挂在了上午上。",
      "2016年5月，三科都比较简单，真要说卡人，案例有点小难度。",
      "2016年11月，三科也都比较简单，真要说卡人，案例有点小难度。",
      "2017年5月，个人感觉3科都很简单，通过率很高。",
      "2017年11月，3科都非常简单，2018年5月，3科又都非常简单。",
      "2018年11月，上午难。",
      "2019年5月，论文卡人，另外2科简单。",
      "2019年11月，3科都不难。",
      "2020年5月，没考2020年11月，很简单。",
      "2021年5月，难度一般，2021年11月，比较难。",
      "2022年5月，难。",
      "2022年11月，难度一般，案例稍微有点难。",
      "2023年5月，难度一般，开始启用第4版的新教材了。",
      "2023年11月，分了4批，选择题都比较简单，第2、3批论文有点难，考了非10大管理。",
      "2024年5月，分了2批，题目还算比较中规中矩，论文都是10大管理内。",
      "2025年5月，分了2批，总体感觉偏难，但是论文改卷很松，整体通过率非常高。",
      "通过以上的举例，在这里我们强调下：",
      [
        "1、这是高级考试，对应的就是高级职称，是高级工程师，难度肯定有。",
        "2、考试特点：杂而不深，需要一些理解记忆，我希望大家能够尽量的保持一颗比较淡定的心学习，不需要很淡定，一定的淡定吧。",
      ],
      "6",
    ],
  },
  {
    page: 7,
    type: "普通",
    content: [
      [
        "3、必须努力：别想着捷径了，没有！",
        "4、怎么学？我平均2天一次讲课（其实我还有别的科目，我是每天晚上都在讲课），我只要没有出差去面授等大事，都是可以做到的，但是大家就做不到了，为什么？？重视问题。我是靠这个在吃饭，我一次没有理由的不讲课，就会引起大家的不满。我说这个事情，就是希望大家能够尽力的重视，尽力的去学习，不要一些芝麻大小的屁事所影响，比如一些无所谓的应酬。OK，就算你不得不去应酬，那么你可以不听实时的，你可以听录播吧？希望还是尽力补上。我不希望我讲了几次的东西还有人在问，为什么？？我烦，别的认真学习的人也烦。每次听课的时候的提问很多都是老问题，嚼之无味了。已经失去了提问环节的作用了。",
        "5、关于动力：很多人没有动力，OK，每天去看看你的银行卡，OK？或者去大街上看看美女、帅哥！我不相信你看到你自己的银行卡寥寥无几的几位数字，你心里不抱怨；我不相信你看到别人身边的美女、帅哥，你心里不荡漾。努力吧。兄弟姐妹！",
      ],
      "毫不夸张的说，只要大家能够把我讲的、多次提到的能够掌握，按照我说的去做，保证可",
      "以及格。",
      "7",
    ],
  },
];
