export default [
  {
    page: 336,
    type: "普通",
    content: [
      "h2:第二十六章 项目管理科学基础",
      "h4:本章考情分析：",
      {
        headers: ["年份", "上午选择题", "案例分析题", "论文写作", "合计"],
        rows: [
          ["2023年5月", "5", "0", "0", "5"],
          ["2023年11月", "5 分左右", "0", "0", "5 分左右"],
          ["2024年", "5", "0", "0", "5"],
          ["2025年", "3", ["7分（第2批）", "10分（第2批）"], "0", "10-13"],
        ],
      },
      "h4:本章学习建议：",
      "本章主要是考选择题，但是2025年考试考到了案例，论文不会考。建议把基础课里讲的几个题型搞会。",
      "h3:官方教程重点考点：",
      "1、静态投资回收期法：必须会",
      "2、动态投资回收期法：必须会",
      "3、净现值：必须会",
      "4、投资收益率法：必须会",
      "5、线性规划：必须会",
      "6、运输问题（伏格尔法）：必须会",
      "7、指派问题（匈牙利法）：必须会",
      "8、最短路径问题：必须会",
      "9、资源分配问题：必须会",
      "10、最短路径问题：尽力会",
      "11、最小生成树：必须会",
      "12、乐观决策法：必须会",
      "13、悲观决策法：必须会",
      "14、悔值决策法：必须会",
      "[[具体请听马老师的讲课。]]"
    ],
  },
];
