export default [
  {
    page: 491,
    type: "普通",
    content: [
      "h2:第三十五章 教材里涉及到的5级分类汇总",
      "[[1、企业智能制造能力成熟度等级]]",
      {
        headers: ["级别", "说明"],
        rows: [
          [
            "im:一级（规划级）",
            "企业应[[开始]]对实施智能制造的基础和条件进行[[规划]]，能够对核心业务、活动（设计、生产、物流、销售、服务）进行流程化管理",
          ],
          [
            "im:二级（规范级）",
            "企业应采用自动化技术、信息技术手段对核心装备和业务活动等进行改造和[[规范]]，实现[[单一业务]]活动的数据共享",
          ],
          [
            "im:三级（集成级）",
            "企业应对装备、系统等开展[[集成，实现跨业务]]活动间的数据共享",
          ],
          [
            "im:四级（优化级）",
            "企业应对人员、资源、制造等进行数据挖掘，形成知识、模型等，实现对核心业务活动的[[精准预测和优化]]",
          ],
          [
            "im:五级（引领级）",
            "企业应基于模型持续驱动业务活动的优化和创新，实现产业链协同并[[衍生]]新的制造模式和商业模式",
          ],
        ],
      },
      "[[2、智慧城市发展成熟度]]",
      {
        headers: ["级别", "说明"],
        rows: [
          [
            "im:一级（规划级）",
            "应围绕智慧城市的发展进行[[策划]]，明确相关职责分工和工作机制等，[[初步]]开展数据采集和应用，确保相关活动有序开展",
          ],
          [
            "im:二级（管理级）",
            "应明确智慧城市发展战略、原则、目标和实施计划等，推进城市基础设施智能化改造，多领域实现信息系统[[单项应用]]，对智慧城市全生命周期实施管理",
          ],
          [
            "im:三级（协同级）",
            "应管控智慧城市各项发展目标，实施[[多业务、多层级、跨领域]]应用系统的集成，持续推进信息资源的共享与交换，推动惠民服务、城市治理、生态宜居、产业发展等的融合创新，实现跨领域的[[协同改进]]",
          ],
          [
            "im:四级（优化级）",
            "应聚焦智慧城市与城市经济社会发展深度融合，基于数据与知识模型实施城市经济、社会精准化治理，推动数据要素的价值挖掘和开发利用，推进城市竞争力[[持续提升]]",
          ],
          [
            "im:五级（引领级）",
            "应构建智慧城市敏捷发展能力，实现城市物理空间、社会空间、信息空间的融合演进和共生共治，[[引领]]城市集群治理联动，形成高质量发展共同体",
          ],
        ],
      },
      "[[3、数据管理能力成熟度模型]]",
      {
        headers: ["级别", "说明"],
        rows: [
          [
            "im:初始级",
            "数据需求的管理主要是在项目级体现，[[没有统一的管理流程，]]主要是被动式管理",
          ],
          [
            "im:受管理级",
            "组织意识到数据是资产，根据管理策略的要求制定了管理流程，指定了相关人员进行[[初步管理]]",
          ],
          [
            "im:稳健级",
            "数据已被当做实现组织绩效目标的重要资产，在组织层面制定了系列的[[标准化管理流程，]]促进数据管理的规范化",
          ],
          [
            "im:量化管理级",
            "数据被认为是获取竞争优势的重要资源，数据管理的效率能[[量化分析]]和监控",
          ],
          [
            "im:优化级",
            "数据被认为是组织生存和发展的基础，相关管理流程[[能实时优化，]]能在行业内进行最佳实践分享",
          ],
        ],
      },
    ],
  },
  {
    page: 492,
    type: "普通",
    content: [
      "[[4、等级保护对象的安全保护等级]]",
      {
        headers: ["级别", "说明"],
        rows: [
          ["im:第一级", "[[不危害国家安全、社会秩序和公共利益]]"],
          ["im:第二级", "[[对社会秩序和公共利益造成危害，但不危害国家安全]]"],
          ["im:第三级", "[[对国家安全造成危害]]"],
          ["im:第四级", "[[对国家安全造成严重危害]]"],
          ["im:第五级", "[[会对国家安全造成特别严重危害]]"],
        ],
      },
      "[[5、不同级别的等级保护对象应具备的基本安全保护能力]]",
      {
        headers: ["级别", "说明"],
        rows: [
          [
            "im:第一级",
            "应能够防护免受来自[[个人的、]]拥有很少资源的威胁源发起的恶意攻击、一般的自然灾难，以及其他相当危害程度的威胁所造成的关键资源损害，在自身遭到损害后，能够恢复部分功能。",
          ],
          [
            "im:第二级",
            "应能够防护免受来自[[外部小型组织的、]]拥有少量资源的威胁源发起的恶意攻击、一般的自然灾难，以及其他相当危害程度的威胁所造成的重要资源损害，能够发现重要的安全漏洞和处置安全事件，在自身遭到损害后，能够在一段时间内恢复部分功能",
          ],
          [
            "im:第三级",
            "应能够在统一安全策略下防护免受来自[[外部有组织的团体、]]拥有较为丰富资源的威胁源发起的恶意攻击、较为严重的自然灾难，以及其他相当程度的威胁所造成的主要资源损害，能够及时发现、监测攻击行为和处置安全事件，在自身遭到损害后，能够较快恢复绝大部分功能",
          ],
          [
            "im:第四级",
            "应能够在统一安全策略下防护免受来自[[国家级别的、敌对组织的、]]拥有丰富资源的威胁源发起的恶意攻击、严重的自然灾难，以及其他相当危害程度的威胁所造成的资源损害，能够及时发现、监测发现攻击行为和安全事件，在自身遭到损害后，能够迅速恢复所有功能",
          ],
          ["im:第五级", "略"],
        ],
      },
      "[[6、软件过程能力成熟度等级]]",
      {
        headers: ["等级", "结果特征", "行为特征"],
        rows: [
          [
            "im:1级：初始级",
            "软件过程和结果[[具有不确定性]]",
            [
              "1、能实现初步的软件交付和项目管理活动",
              "2、项目没有完整的管理规范，依赖于个人的主动性和能力",
            ],
          ],
          [
            "im:2级：项目规范级",
            "项目[[基本可按]]计划实现预期的结果",
            [
              "1、项目依据选择和定义管理规范，执行软件开发和管理的基础过程",
              "2、组织按照一定的规范，为项目活动提供了支持保障工作",
            ],
          ],
          [
            "im:3级：组织改进级",
            "在组织范围内能够[[稳定地实现]]预期的项目目标",
            [
              "1、在2级充分实施的基础之上进行持续改进",
              "2、依据组织的业务目标、管理要求以及外部监管需求，建立并持续改进组织标准过程和过程资产",
              "3、项目根据自身特征，依据组织标准过程和过程资产，实现项目目标并贡献过程资产",
            ],
          ],
          [
            "im:4级：量化提升级",
            "在组织范围内能够[[量化地管理]]和实现预期的组织和项目目标",
            [
              "1、在3级充分实施的基础上使用统计分析技术进行管理",
              "2、组织层面认识到能力改进的重要性，了解软件能力在业务目标实现、绩效提升等方面的重要作用，在制定业务战略时可获得项目数据的支持",
              "3、组织和项目使用统计分析技术建立了量化的质量与过程绩效目标，支持组织业务目标的实现",
              "4、建立了过程绩效基线与过程绩效模型",
              "5、采用有效的数据分析技术，分析关键软件过程的能力，预测结果，识别和解决目标实现的问题以达成目标",
              "6、应用先进实践，提升软件过程效率或质量",
            ],
          ],
          [
            "im:5级：创新引领级",
            "通过技术和管理的创新，实现组织业务目标的持续提升，[[引领]]行业发展",
            [
              "1、在4级充分实施的基础上进行优化革新",
              "2、通过软件过程的创新提升组织竞争力",
              "3、能够使用创新的手段实现软件过程能力的持续提升，支持组织业务目标的达成",
              "4、能将组织自身软件能力建设的经验作为行业最佳案例进行推广",
            ],
          ],
        ],
      },
    ],
  },
  {
    page: 493,
    type: "普通",
    content: [
      "[[7、ISSE-CMM体系结构7、ISSE-CMM体系结构]]",
      {
        headers: ["级别", "公共特性", "通用实施"],
        rows: [
          ["((Level 1：非正规实施级))", "执行基本实施", "1.1.1执行过程"],
          [
            "rows-4:((Level 2：规划和跟踪级))",
            "规划执行",
            [
              "2.1.1为执行过程域分配足够资源",
              "2.1.2为开发工作产品和（或）提供过程域服务指定责任人",
              "2.1.3将过程域执行的方法形成标准化和（或）程序化文档",
              "2.1.4提供支持执行过程域的有关工具",
              "2.1.5保证过程域执行人员获得适当的过程执行方面的培训",
              "2.1.6对过程域的实施进行规划",
            ],
          ],
          [
            "规范化执行",
            [
              "2.2.1在执行过程域中，使用文档化的规划、标准和（或）程序",
              "2.2.2在需要的地方将过程域的工作产品置于版本控制和配置管理之下",
            ],
          ],
          [
            "验证执行",
            [
              "2.3.1验证过程与可用标准和（或）程序的一致性",
              "2.3.2审计工作产品（验证工作产品遵从可适用标准和（或）需求的情况）",
            ],
          ],
          [
            "跟踪执行",
            [
              "2.4.1用测量跟踪过程域相对于规划的态势",
              "2.4.2当进程严重偏离规划时采取必要修正措施",
            ],
          ],
          [
            "rows-3:((Level 3：充分定义级))",
            "定义标准化过程",
            ["3.1.1对过程进行标准化", "3.1.2对组织的标准化过程族进行裁剪"],
          ],
          [
            "执行已定义的过程",
            [
              "3.2.1在过程域的实施中使用充分定义的过程",
              "3.2.2对过程域的适当工作产品进行缺陷评审",
              "3.2.3通过使用已定义过程的数据管理该过程",
            ],
          ],
          [
            "协调安全实施",
            [
              "3.3.1协调工程科目内部的沟通",
              "3.3.2协调组织内不同组间的沟通",
              "3.3.3协调与外部组间的沟通",
            ],
          ],
          [
            "rows-2:((Level 4：量化控制级))",
            "建立可测度的质量目标",
            "4.1.1为组织标准过程族的工作产品建立可测度的质量目标",
          ],
          [
            "对执行情况实施客观管理",
            [
              "4.2.1量化地确定已定义过程的过程能力",
              "4.2.2当过程未按过程能力执行时，适当地采取修正行动",
            ],
          ],
          [
            "rows-2:((Level 5：持续改进级))",
            "改进组织能力",
            [
              "5.1.1为改进过程效能，根据组织的业务目标和当前过程能力建立量化目标",
              "5.1.2通过改变组织的标准化过程，从而提高过程效能",
            ],
          ],
          [
            "改进过程的效能",
            [
              "5.2.1执行缺陷的因果分析",
              "5.2.2有选择地消除已定义过程中缺陷产生的原因",
              "5.2.3通过改变已定义过程来连续地改进实施",
            ],
          ],
        ],
      },
    ],
  },
  {
    page: 494,
    type: "普通",
    content: [
      "[[8、OPM成熟度]]",
      {
        headers: ["级别", "说明"],
        rows: [
          [
            "im:级别1，初始或临时的OPM",
            "项目绩效[[无法可靠预测。项目管理极不稳定]]，高度依赖于执行工作的人员的经验和能力。项目虽然完成，但经常出现推迟、超出预算、质量各异的情况。存在的OPM流程是临时的或无序的。",
          ],
          [
            "im:级别2，项目层级采用OPM",
            "根据行业最佳实践，[[在项目或职能层级上]]计划、执行、监督和控制项目。但是OPM流程和实践并非从组织角度统一应用或管理，并且可能存在项目差异。",
          ],
          [
            "im:级别3，组织定义的OPM",
            "项目管理是主动的，组织项目绩效是可预测的。项目团队遵循组织建立的OPM流程，这些流程根据项目的复杂性和从业者的能力加以裁剪。OPM流程[[在组织上是标准化的、]]可测量的、可控制的，并可由组织进行分析，以监控OPM流程绩效",
          ],
          [
            "im:级别4，量化管理的OPM",
            "组织中的项目管理决策和流程管理是由数据驱动的。OPM流程绩效的管理方式能够实现[[量化改进]]目标。OPM流程绩效经过了系统性分析，以提高为组织增加价值的改进机会",
          ],
          [
            "im:级别5，持续优化的OPM",
            "组织稳定且专注于[[持续改进。]]OPM与组织战略的一致性，以及定义好的和可测量的价值贡献为关注点的OPM流程，促进了组织的敏捷和创新。在优化的组织中，已建立了有效的持续改进，以及一系列测量和度量指标。项目集和项目的成功率很好，项目组合经过优化以确保业务价值。",
          ],
        ],
      },
    ],
  },
  {
    page: "495,496",
    type: "普通",
    content: [
      "9、CMMI级别与表示方法",
      {
        headers: ["级别", "说明"],
        rows: [
          [
            "im:第1级初始级",
            [
              "各个实践域的活动应该能够在组织中得到[[基本的执行]]，其级别特征主要包括",
              "1、满足实践域意图的初步方法能够得到基本实现；",
              "[[2、没有一套完整的实践来满足实践域的全部意图；]]",
              "3、开始专注于能力问题。",
            ],
          ][
            ("im:第2级管理级",
            [
              "所有第1级的要求都已经达到，另外，组织在项目实施上能够遵守项目团队既定的工作计划与流程，对需求、任务、产出物、度量数据、相关的实施人员能够实现相应的管理，对整个流程进行监测与控制。达到成熟度2级水平的组织对项目有一系列管理方式，避免了组织完成各个项目目标的随机性，保证了组织内项目实施的成功率。每个项目都可以使用自己的方式达到实践域的目标，其级别特征主要包括：",
              "[[1、简单但完整的一组实践，能够满足实践域的全部目的；]]",
              "2、不需要使用组织资产或标准；",
              "3、对项目的各个方面实现了管理；",
              "4、实践的意图可以基于项目以各种方式得到满足。",
            ])
          ],
          [
            "im:第3级定义级",
            [
              "所有第2级实践的意图和价值都已经达到，并且组织能够根据自身的情况定义适用于自身的标准过程，将这套管理体系与流程实现制度化。同时，要求组织能够建立过程资产，基于历史项目的可复用过程资产（包括管理资产和技术资产）得到有效的复用，从而提高项目的成功率。组织不仅能够在当前同类项目上取得成功，也能够在其他项目上成功。组织的管理流程成为组织的一种文化，成为组织的财富。其级别特征主要包括：",
              "[[1、采用组织标准流程开展各项工作；]]",
              "2、能够依据项目特征对组织的标准流程进行裁剪以解决特定的项目和工作特征；",
              "3、项目能够使用和向组织贡献过程资产。",
            ],
          ],
          [
            "im:第4级量化管理级",
            [
              "所有第3级实践的意图和价值都能够达成。另外，组织的管理实现了量化，实现了可预测。通过统计或其他量化技术来实现过程性能的稳定性监控和复合型监控，实现管理的精细化，降低项目在过程能力和质量上的波动。组织能够通过历史数据构建可预测模型，对组织和项目的质量和过程性能目标实现可预测。其级别特征主要包括：",
              "1、使用统计和其他量化技术来监测，完善或预测关键过程领域，从而实现组织或项目的质量与过程性能目标；",
              "2、以统计和量化管理的方式了解组织或项目的效率效能变化，并根据质量和过程性能目标的情况管理组织和项目的效率效能。",
            ],
          ],
          [
            "im:第5级优化级",
            [
              "所有第4级实践的意图和价值都能够达成。另外，组织能够充分利用其管理数据和量化的方法对组织在项目实施的过程中可能出现的不符合策划的内容进行预防。组织能够主动地改进标准过程，运用新技术和方法实现流程的持续优化。其级别特征主要包括：",
              "1、使用统计和其他量化技术来[[优化效率]]效能并改善组织目标的实现，包括业务、度量和效率效能以及质量与过程性能目标；",
              "2、能够通过基于量化的持续优化来持续支持组织业务目标的达成。",
            ],
          ],
        ],
      },
    ],
  },
];
