// ch_31 - 已转换为 DSL 字符串格式

export default [
  {
    page: 470,
    type: "普通",
    content: [
      "h2:第三十一章49个过程进行的频次",
      [
        "1、仅开展一次或仅在预定义时点开展的项目管理过程",
      ],
      {
        headers: ["序号|", "过程名"],
        rows: [
          ["项目章程尽量在整个项目期间保持不变", "各种管理（程序性）计划和项目基准尽量在整个项目期"],
          ["间保持不变", "除规划沟通管理过程和规划干系人参与过程以外的全部规划XX管理过程。这些过程的输出都是作为程序性计划的“XX管理计划”，尽量在整个项目期间保持不"],
          ["变", "项目范围尽量保持不变。敏捷型项目，也仅在迭代期开始时（预定义时点）变更。项目预算尽量保持不变。敏捷型项目，也仅在迭代期"],
          ["定期识别干系人", "定期调整沟通管理计划（主要是调整实体性计划）定期调整干系人参与计划（主要是调整实体性计划）这三个过程，列作“需要持续开展的过程”更合适，与定义活动过程、估算活动持续时间过程对应"],
          ["定期开展采购", "在可交付成果形成时，及时进行验收（阶段性验收）"],
          ["说明", "虽然进度基准（高层级进度计划）应尽量不变，但是详细的进度计划需要随项目进展而不断编制和调版权所有，侵权必究 购课淘宝店铺：91grk.taobao.com"],
        ],
      },
    ],
  },
  {
    page: 471,
    type: "普通",
    content: [
      {
        headers: ["4", "5"],
        rows: [
          ["实施定性风险分析", "需要经常识别风险，并开展相应的风险分析和应对"],
          ["实施风险应对", "除了获取资源过程和实施采购过程，全部执行过程都需要持续开展。其实，获取活动资源过程也需要持续开展，因为定义活动过程是持续开展的"],
          ["监督风险", "除了确认范围过程，全部监控过程都需要持续开展。监控贯穿项目的始终。控制采购过程在合同存"],
        ],
      },
    ],
  },
];
