import note2_1 from "../imgs/note2_1.png";
import note2_2 from "../imgs/note2_2.png";
import note2_3 from "../imgs/note2_3.png";
import note2_4 from "../imgs/note2_4.png";

export default [
  {
    page: 0,
    type: "普通",
    content: [
      "h2:进度网络图",
      "h3:标准差",
      [
        "1、期望时间=(乐观+4X最可能+悲观)/6",
        "2、标准差(西格玛)=(悲观-乐观)/6",
        "3、口诀:期望时间标中间，左右加减西格玛，概率数值要牢记，数学变成画图题。",
      ],
      `img:${note2_4}`,
      "99.73%, 95%, 68%",
      "h3:决策论-不确定型决策分析",
      [
        "不确定型决策分析∶((乐观))决策准则、((悲观))决策准则、折中决策准则、((后悔值))决策准则、等概率决策准则。",
        [
          "((最大最大（max-max）准则∶))最大最大准则也称((乐观))准则，它找出每种行动的最好结果，再从最好结果中找一个更好的做为选择。",
          "((最大最小（max-min）准则∶ ))最大最小准则也称((悲观))准则，也叫小中取大，它找出每种行动的最坏结果，再从最坏结果中找一个最好的做为它的选择。",
          "最小机会损失准则（min-max）也称((最小最大后悔))准则，它利用机会成本的概念来进行决策。决策首先要计算机会损失（后悔值）矩阵;机会损失的概念是，当一个事件发生时，由于你没有选择最优决策而带来的收入损失。",
        ],
        "((最小最大后悔值))法∶也称萨凡奇决策准确性准则，决策者不知道各种自然状态中任一种发生的概率，决策目标是确保避免较大的机会损失。运用最小最大后悔值法时，((首先要将决策矩阵从利润矩阵转变为机会损失矩阵;然后确定每一可选方案的最大机会损失; 再次，在这些方案的最大机会损失中，选出一个最小值，与该最小值对应的可选方案便是决策选择的方案。))",
      ],
      [
        "最小最大后悔值法（在最大后悔值中选择最小的）也叫机会损失最小值决策法，它是一种根据机会成本进行决策的方法，以各方案机会损失大小来判断方案的优劣。",
        "后悔值是指当某种自然状态出现时，决策者从若干方案中选优时没有采取能获得最大收益的方案，而采取了其他方案以致在收益上产生的某种损失。",
        "后悔值=各个方案在该概率事件下的最优收益-该概率事件下该方案的收益最小最大后悔值法作决策的步骤如下：",
        [
          "(1）计算每个方案在各种情况下的后悔值；",
          "(2）找出各方案的最大后悔值；",
          "(3）选择最大后悔值中的最小方案作为最优方案。",
        ],
      ],
      "h3:关键路径法（Critical Path Method）",
      [
        "关键路径（Critical Path）是项目中历时最长的那条路径，决定项目最短的完成时间，一个进度网络图中可能有多条关键路径，关键路径上的活动被称为关键活动，关键活动的工期之和就是项目的总工期。",
        "总浮动时间（TF），又称作总时差，不延误总工期。正常情况下，关键活动的总浮动时间为零。",
        "自由浮动时间（FF），又称作自由时差，不延误任何紧后活动。正常情况下，关键活动的自由浮动时间为零。",
        "总时差为零的活动，自由时差肯定为零。",
        "自由时差为零的活动，总时差不一定为零。",
      ],
      "h3:七格图",
      "((不考虑任何资源限制的情况下))，沿着项目进度网络路径进行顺推与逆推分析，计算出全部活动理论上的最早开始和完成日期、最迟开始和完成日期。",
      {
        rows: [
          ["最早开始时间ES", "工期", "最早完成时间EF"],
          ["cols-3:活动名称"],
          ["最迟开始时间LS", "总浮动时间TF", "最迟完成时间LF"],
        ],
      },
      [
        "ES：最早开始日期",
        "EF：最早结束日期",
        "DU：活动历时",
        "LS：最晚开始日期",
        "LF：最晚结束日期",
        "FF：自由时差",
        "TF：总时差",
      ],
      [
        "相关公式：",
        "EF=ES+DU",
        "LS=LF-DU",
        "ES=取最大值（前置活动的EF）",
        "LF=取最小值（后续活动的LS）",
        "总时差=LS-ES=LF-EF",
        "自由时差=取最小值（后续活动ES-EF）",
      ],
      "自由时差：在不延误紧随活动的最早开始日期的情况下，该活动可以推迟的时间。",
      "总时差：在不延误项目完成日期的情况下，该活动自其最早时间起可以延误的时间。",
      {
        rows: [
          ["最早开始时间（ES）", "某项活动能够开始的最早时间"],
          ["最早结束时间（EF）", "某项活动能够完成的最早时间。EF=ES+工期估算"],
          [
            "最迟结束时间（LF）",
            "为了使项目按时完成，某项工作必须完成的最迟时间",
          ],
          [
            "最迟开始时间（LS）",
            "为了使项目按时完成，某项工作必须开始的最迟时。LS=LF-工期估算",
          ],
          [
            "总时差=LS-ES=LF-EF",
            [
              "((本活动的))最迟开始时间一本活动的最早开始时间",
              "指一项工作在不影响总工期的前提下所具有的机动时间",
            ],
          ],
          [
            "自由时差=((min))(紧后工作的ES - 此活动的EF)",
            "指一项工作在不影响后续工作的情况下所拥有的机动时间",
          ],
          [
            "cols-2:1、关键路径上工作的最早开始时间等于最晚开始时间、最早结束时间等于最晚结束时间。((关键活动（关键路径上的活动）的总时差、自由时差都是0。))",
          ],
          [
            "cols-2:2、自由时差＝紧后活动的最早开始时间一本活动的最早结束时间(((如果有多个紧后活动，则紧后活动的最早开始时间是这些活动的最早开始时间的最早者)。))",
          ],
        ],
      },
      "h2:挣值分析",
      "AC=实际工作量×实际单价",
      "PV=计划工作量×计划单价",
      "EV=实际工作量×计划单价",
      {
        headers: ["简称", "说明", "公式说明"],
        rows: [
          ["cols-3:[[完工预算]]"],
          ["BAC", "完工预算", "整个项目的预算(总的PV)"],
          ["cols-3:[[应该干多少]]"],
          ["PV", "计划值", "计划完成工作的预算值"],
          ["cols-3:[[干了多少]]"],
          ["EV", "挣值", "实际完成工作的预算值"],
          ["cols-3:[[花了多少]]"],
          ["AC", "实际成本", "实际花费成本"],
          ["cols-3:[[剩下工作成本]]"],
          ["ETC", "完工尚需估算", "剩下的工作还需多少钱"],
          ["cols-3:[[全部工作成本]]"],
          ["EAC", "完工估算", "实际成本+完工尚需估算 AC+ETC"],
          ["cols-3:"],
          ["VAC", "完工偏差", "VAC=BAC-EAC"],
          ["SV", "进度偏差", "挣值-计划值 EV-PV"],
          ["SPI", "进度偏差指数", "挣值/计划值 EV/PV"],
          ["CV", "成本偏差", "挣值-实际成本 EV-AC"],
          ["CPI", "成本偏差指数", "挣值/实际成本 EV/AC"],
        ],
      },
      {
        rows: [
          ["PV", "计划值", "计划完成工作的预算值"],
          ["EV", "挣值", "实际完成工作的预算值"],
          ["AC", "实际成本", "实际花费成本"],
        ],
      },
      {
        rows: [
          ["SV", "进度偏差", "挣值-计划值 EV-PV"],
          ["SPI", "进度偏差指数", "挣值/计划值 EV/PV"],
          ["CV", "成本偏差", "挣值-实际成本 EV-AC"],
          ["CPI", "成本偏差指数", "挣值/实际成本 EV/AC"],
        ],
      },
      {
        headers: ["偏差分析", "偏差为正：>0", "偏差为负：<0"],
        rows: [
          ["成本偏差（CV）", "节约成本", "成本超支"],
          ["进度偏差（SV）", "工期提前（货币单位）", "工期滞后（货币单位）"],
          ["SV和CV同时", "成本节约，工期提前", "成本超支，工期滞后"],
        ],
      },
      {
        headers: ["偏差分析", "原因分析"],
        rows: [
          ["CV为正;SV为负", "资源没到位，没开工，所以省钱，进度落后"],
          ["CV为负;SV为正", "可能在赶工，拿资源换时间，所以花钱多，进度提前"],
        ],
      },
      {
        headers: ["绩效分析", "绩效指数>1", "绩效指数<1"],
        rows: [
          [
            "工期绩效指数（SPI）",
            "工期提前（货币单位）",
            "未完成计划（货币单位）",
          ],
          ["成本绩效指数（CPI）", "比计划成本节约", "比计划成本超支"],
        ],
      },
      {
        rows: [
          ["BAC", "完工预算", "整个项目的预算（总的PV）"],
          ["ETC", "完工尚需估算", "剩下的工作还需多少钱"],
          ["EAC", "完工估算", "实际成本+完工尚需估算AC+ETC"],
          ["VAC", "完工偏差", "VAC=BAC-EAC"],
        ],
      },
      {
        rows: [
          [
            "ETC=剩下工作量对应的计划值=总计划值-已完成工作的计划值（EV），即 ETC=BAC-EV",
            "((非典型))",
          ],
          [
            "((ETC))’=剩下工作量对应计划值/成本绩效指数=ETC/CPI=(BAC-EV)/((CPI))",
            "((典型))",
          ],
          [
            "完工绩效指数 (TCPI) (To Complete Performance Index)",
            "TCPI=(BAC-EV)/(BAC-AC)或(EAC-AC)",
          ],
        ],
      },
      "h3:预测技术（完工估算）",
      {
        headers: ["情景", "计算公式"],
        rows: [
          [
            "以前估算假设不成立，剩余工作重新估算",
            "EAC=AC+ETC（自下而上重新估算）",
          ],
          ["如果没有偏差或偏差不典型", "EAC=AC+BAC-EV=BAC-CV"],
          [
            "如果有典型偏差，即以当前CPI完成ETC工作",
            "EAC=AC+(BAC-EV)/CPI=BAC/CPI",
          ],
          ["假设SPI与CPI将同时影响ETC工作", "EAC=AC+(BAC-EV)/(CPI*SPI)"],
          ["cols-2:CPI=EV/AC"],
        ],
      },
      "h3:典型偏差",
      "EAC=AC+ETC=AC+(BAC-EV)/CPI=(AC*CPI+BAC-EV)/CPI=(AC*EV/AC+BAC-EV)/CPI=BAC/CPI=BAC/(EV/AC)=AC/(EV/BAC)",
      "h3:完工尚需绩效指数（TCPI）是—种为了实现特定的管理目标，剩余资源的使用必须达到的成本绩效指标，是完成剩余工作所需的成本与剩余预算之比。TCPI是指为了实现具体的管理目标（如BAC或EAC）,剩余工作的实施必须达到的成本绩效指标。如果BAC已明显不再可行，则项目经理应考虑使用EAC进行TCPI计算。",
      "h2:线性规划",
      "h3:下图是某地的街区网络图(单位：公里)，疫情防控期间，一辆消毒车从中心出发，需要消杀所有的街道并返回疾控中心。该消毒车完成消杀工作至少运行 ( ) 公里。",
      `img:${note2_1}`,
      [
        "1. 首先所有路径相加：5+4+2+3+2+2+3+5+1+2+1+6+7=43，",
        "2. 看图有几个奇数点和偶数点，三角是奇数点，圆形是偶数点，此图有二奇四偶。",
        "3. 根据欧拉定理：",
        [
          "① 凡是由偶点组成的连通图，一定可以一笔画成。画时可以把任一偶点为起点，最后一定能以这个点为终点画完此图。",
          "② 凡是只有两个奇点的连通图（其余都为偶点），一定可以一笔画成。画时必须把一个奇点为起点，另一个奇点为终点。",
          "③ 其他情况的图都不能一笔画出。(奇点数除以2便可算出此图需几笔画成。)",
        ],
        "4. 得出结论，两个奇数点，一个是起点，一个是终点，所有的路全走了一遍。最后此题要求车要回到出发点，就再加上两个奇数点的距离，即可。所以：43+5=48",
      ],
      "h3:某乳制品加工厂用纯牛奶和酸牛奶两种生产原料，加工生产甲、乙两种乳制品、该厂加工每单位乳制品消耗原料数、每单位乳制品的利润如下所示。则该公司的最大利润为（   ） 万元。公司获得最大利润时，生产甲的数量是 （   ） 吨。",
      {
        headers: ["cols-2:", "甲", "乙", "现有原料（吨）"],
        rows: [
          ["rows-2:原料（吨）", "纯牛奶", "1", "2", "86"],
          ["酸牛奶", "5", "3", "150"],
          ["cols-2:利润（万元）", "3", "4", ""],
        ],
      },
      "假设甲乳制品生产的数量是X吨，乙乳制品生产的数量是Y吨。根据题干可以得到：不等式1：X+2Y≤86，不等式2：5X+3Y≤150；",
      "采取消元法，我们求得X=6，Y=40，可以使得该公司的最大利润=6×3+40×4=178（万元），这个时候生产甲乳制品生产的数量是6吨。",
      "h3:某电池厂生产甲、乙两种型号产品（单位：万个），这两种产品都需要设备和A、B两种原材料，利润与资源限制条件如表所示，为了获得最大的利润，该电池厂每天生产的甲产品的数量应为 （   ） 万个，此时该企业每天的利润为 （   ） 万元。",
      {
        headers: ["", "甲", "乙", "资源限制条件"],
        rows: [
          ["设备（台时）", "2", "3", "20"],
          ["原材料A（千克）", "3", "1", "15"],
          ["原材料B（千克）", "0", "2", "12"],
          ["利润（万元）", "2", "4", ""],
        ],
      },
      "假设生产甲产品的数量为x（万个），生产乙产品的数量为y（万个），则：2x + 3y ≤ 20 ，3x + y ≤ 15，2y ≤ 12",
      "求 MAX(2x + 4y) 则 y ≤ 6，x ≤ 1，所以 y = 6，x = 1，MAX(2x+4y) = 26",
      "h3:某炼油厂根据计划每季度供应合同单位汽油和煤油各16吨。该厂从甲、乙两处产地运回原油提炼，已知两处原油成分如下表所示，且从甲、乙两地采购成本分别为200元/吨和300元/吨。对于该炼油厂，需要从乙地采购 （   ） 吨方能使此次采购的成本最低，最低的采购成本是 （   ） 元。",
      {
        headers: ["原油成分", "甲", "乙"],
        rows: [
          ["汽油", "20%", "40%"],
          ["煤油", "50%", "20%"],
          ["其他", "30%", "40%"],
        ],
      },
      "设从甲地采购 X 吨，从乙地采购 Y 吨。",
      "0.2X + 0.4Y ≥ 16（吨），0.5X + 0.2Y ≥ 16（吨），",
      "解出：X = 20（吨），Y = 30（吨）",
      "成本 = 200 * 20 + 300 * 30= 13000（元）",
      "h2:图论",
      "h3:下图为某地区的通信线路图，图中节点为8个城市，节点间标识的数字为城市间拟铺设通信线路的长度，为了保持8个城市通信连接，则至少铺设 （   ） km的线路。",
      `img:${note2_2}`,
      "先断开最大的，然后保留最小和次小的，接着再断开次小的，以此类推。",
      "最终保证8个城市的通信处于连接。最终计算结果，200+100+200+200+100+200+300=1 300（km）",
      "h3:有8口海上油井，相互间距离如下表所示（单位：海里）。其中1号井离海岸最近，为5海里。现要从海岸经1号井铺设油管将各井连接起来，则铺设输油管道的最短长度为（ ） 海里。",
      `img:${note2_3}`,
      "此题考核的知识点是管理科学基础最小生成树。",
      "最短长度为：5+0.7+0.7+0.8+0.6+0.5+1+0.9=10.2。",
    ],
  },
];
